; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.9.0
; Author:	sklado <sklado@orangemail.sk>
; Homepage:
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode format (UTF-16) and Zip it to preserve formatting
;	E-mail new language files to gora@7zsfx.info for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents of each %s variable is hardcoded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
1=Súbor
2=Voľby
3=Pomocník
4=&Skontrolovať najprv ako SFX archív
; ------------------------------------
5=Vybrať súbor
6=&Archív/Inštalátor na rozbalenie:
7=Vybrať adresár
8=A&dresár pre rozbalenie:
9=Na túto záložku môžete potiahnuť a pustiť súbor
; ------------------------------------
10=Voľby %s
11=Sledovať &históriu archívov
12=Skryť okno s &konzolou
13=&Ponúkať aktualizácie:
14=&Jazyk:
15=&Zapamätať si a zamknúť veľkosť okna
16=&Nezatvárať okno po rozbalení
; ------------------------------------
17=Špecifické voľby formátu
18=Upozorniť pr&ed spustením súborov
19=&Odstrániť duplicitné súbory
20=Ods&trániť dočasné súbory
21=Dop&lniť chýbajúce prípony súborov
22=&Vymazať súbor po úspešnom rozbalení
; ------------------------------------
23=O programe
; ------------------------------------
24=Domovská stránka %s
25=Stránka oficiálnej verzie
26=Fórum upravenej verzie
; ------------------------------------
27=Aktualizujem
28=Posledná kontrola na aktualizáciu bola pred viac ako %s dňami!
29=Skontrolovať aktualizácie teraz?
30=Inte&grácia do shell-u
; ------------------------------------
31=&Rozbaliť
32=&Uložiť
33=Aktualizova&ť
34=Zru&šiť
35=Nastavenia
; ------------------------------------
36=Rozbaľovanie %s
37=%s podporuje nasledovné metódy na rozbalenie %s balíkov.%nBohužiaľ, ani jedna z týchto metód nie je na 100% spoľahlivá.%nAk vybratá metóda nefunguje, prosím spustite %s znovu a vyberte inú metódu.
; ------------------------------------
38=Metóda rozbalenia
39=%s Administrátorský inštalátor
40=%s rozbalenie
41=%s prepínač
42=%s rozbaľovač
43=Nie je InstallShield inštalátor
44=Po roz&balení zobraziť sumár
; ------------------------------------
; GUI control functions
45=Zakázať zvuk&y v programe
46=Verzia 7-Zip
47=Súbor neexistuje:%n%s%nVyberte prosím existujúci súbor.
48=Otvoriť súbor
49=Zapísať do
50=Všetko
; Common terms
51=archív
52=skomprimovaný súbor
53=Čas: %s
54=ebook
55=ecard
56=zakódovaný súbor
57=neznámy spustiteľný
58=Inicializácia zlyhala
59=súbor pomocníka
60=rychlá aktualizácia programu
61=obraz
62=inštalátor
63=spojiť modul
64=balík
65=záplata
66=Samorozbaľovací
67=etapa
68=Inicializácia úspešná
69=Testovanie
70=Rozbaľovanie:
71=Veľkosť archívu
72=aktualizácie
73=Názov archívu
74=každý týždeň|každé dva týždne|každý mesiac|nikdy
; Status messages
75=Skenovanie súboru na zistenie typu súboru
76=Skenovanie súboru s %s scanom
77=Rozbaľovanie súborov z:
78=Čakanie na inicializáciu inštalátora.%nProsím čakajte
79=Pre prerušenie rozbaľovania stlačte kláves ESC%nMinimalizovať/Obnoviť okno stlačením klávesu F11
; Custom prompts
80=%s CD-ROM obrazy nemôžu byť rozbalené priamo.%nNamiesto toho, tento obraz bude skonvertovaný na ISO CD-ROM obraz,%nktorý bude potom rozbalený.%n%nChcete pokračovať?%nPoznámka: Tento proces môže zabrať niekoľko minút!
81=Chyba: CD-ROM obraz nemôže byť skonvertovaný.
82=Chyba: ISO obraz bol vytvorený z %s obrazu, ale nemôže byť skonvertovaný.%nChcete ponechať ISO obraz pre ďalšiu analýzu?
83=Chyba: Zdá sa, že toto nie je platný MHT súbor.%nŽiadne hranice nezistené.
84=%s. Prosím, ukončite inštalátor, potom kliknite 'OK' pre pokračovanie.
85=Poznámka: Táto metóda pracuje len so špecifickými Wise inštalačnými balíkmi pre Windows.%nAk sa Wise Inštalačný sprievodca spustí a čaká na vstup, tento súbor nie je podporovaný.%nProsím, ukončite inštalátor a %s ukončí rozbaľovanie.%n%nChcete pokračovať v rozbaľovaní?
86=Tento súbor je zbalený s %s kompresiou.%nMôžete pokračovať v rozbaľovaní bez %s rozbaľovanie,%nalebo uskutočniť iba %s rozbalenie.%n%nKliknite 'Áno' pre rozbalenie bez %s rozbaľovania.%n%nKliknite 'Nie' pre spustenie %s rozbaľovania.%n%nNeskôr bude rozbaľovaný súbor pomenovaný:%n%s
87=Chyba: %s%nnemôže byť rozbalený.
88=Varovanie: Na rozbalenie súborov tohto typu, musí byť tento súbor priamo spustený.%nAk budete pokračovať, spustí sa nasledovný príkaz:%n%n%s%n%nAk veríte, že tento súbor by mohol byť zákerný, odporúča sa nepokračovať.%nChcete pokračovať v rozbaľovaní?
89=Varovanie: Cieľový adresár %s už existuje!%nRozbalenie do neprázdneho adresára môže viesť ku chybe rozbalenia.%n%nVyčistite obsah adresára pred rozbalením?
90=Pre rozbalenie je potrebné heslo!%n%nOdznačte '%s'%npre povolenie zadania hesla?
91=Pre rozbalenie tohto archívu potrebujete prídavný%nrozbaľovač %s
; Help text
92=Rozbalenie súborov z rôznych typov archívov alebo inštalačného balíka.%nPoužitie:%n%s%n%nPodporované argumenty:%n%s%t%tZobraziť túto informáciu pomocníka%n%s%t%tOtvoriť záložku %s%n%s%tNázov súboru pre rozbalenie%n%s%tAdresár, do ktorého rozbaliť%n%nPoužitím %s namiesto názvu cieľového adresára prinutí%n%s k rozbaleniu do podaresára pomenovaného podľa archívu.%n%nPríklad:%s%n%nSpustenie %s bez argumentov zobrazí hlavné okno, kde používateľ môže zadať názov súboru a cieľový adresár.
93=Rozbaliť pomocou %s
; Error messages
94=Rozbaľovanie %s nemôže byť zalogované.
95=7-Zip archivátorom
96=%s nemôže byť rozbalený.%nTyp vráteného súboru bol: %s%n%nKliknite 'OK', ak chcete analyzovať súbor sami, alebo 'Zrušiť' pre ukončenie.
97=%s%nmá neznámu príponu alebo nemôže byť rozbalený.
98=Nie je možné vytvoriť adresár:%s%nProsím, vyberte správne umiestnenie.
99=%s nemôže byť rozbalený.%nZdá sa, že to je %s, ktorý je podporovaný, ale rozbalenie zlyhalo.%nPre viac informácií prosím pozrite log súbor %s.%n%nKliknite 'OK' na pozretie log súboru teraz, alebo 'Zrušiť' pre ukončenie.
100=%t–= %s analýzy =–
; Update messages
101=Aktualizácia dokončená
102=Kontrola aktualizácií, prosím, čakajte...
103=Sťahovanie súborov
104=Sťahovanie dokončené!
105=Aktualizované na verziu: %s
106=%nReštartovanie %s!
107=Vaša aktuálna verzia je: %s%nAktualizácia nie je potrebná!
; ------------------------------------
108=Chyba sťahovania
109=Nemožno stiahnuť zoznam súborov zo servera.%nVaše sieťové pripojenie može byť odpojené%nalebo aktualizačný server je nedostupný.
110=Zlyhalo sťahovanie súboru
111=Chyba pri rozbaľovaní súboru
112=Počas aktualizácie na verziu: %s%nsa vyskytla chyba, opakujte!!!
113=Dokončené: %s z %s
114=Informácia
115=Verzie rozbaľovačov
116=Otvoriť adresár rozbaľovania?
117=Riadok v tabuľke
118=Oddeľovač
119=Otvoriť iba najvyššiu &úroveň archvívu
120=Analýza PE súboru
121=Zlyhalo spracovanie MSI súboru
122=Kvôli 'hlbokému' umiestneniu MSI balíka, nemožno dosiahnuť %s súbor(y).%nPre detaily si pozrite %s.%n%nPresunúť balík MSI bližšie ku koreňu jednotky a zopakovať rozbaľovanie.%n%nKliknite 'OK', pre zobrazenie log súboru, alebo 'Zrušiť' pre ukončenie.
123=podpisy -
124=Vybrať typ archívu ručne (zo zoznamu)?
125=Vybrať podpis údajného typu archívu
126=Pokúsiť sa rozbaliť s 'TotalObserver'?